Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rhea-so.aws_route53_zone.domain has changed
~ resource "aws_route53_zone" "domain" {
        id            = "Z0097287UVNCC6G4O03H"
        name          = "rhea-so.com"
      + tags          = {}
        # (6 unchanged attributes hidden)
    }

  # module.production.module.atlantis-rhea-so.aws_route53_record.domain has changed
~ resource "aws_route53_record" "domain" {
        id              = "Z0097287UVNCC6G4O03H_atlantis.rhea-so.com_A"
        name            = "atlantis.rhea-so.com"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # module.production.module.api-gateway.aws_api_gateway_integration.iac-api-gateway-integration will be created
+ resource "aws_api_gateway_integration" "iac-api-gateway-integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "http://google.com"
    }

  # module.production.module.api-gateway.aws_api_gateway_method.iac-api-gateway-method-google-enter will be created
+ resource "aws_api_gateway_method" "iac-api-gateway-method-google-enter" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.production.module.api-gateway.aws_api_gateway_resource.iac-api-gateway-resource-google will be created
+ resource "aws_api_gateway_resource" "iac-api-gateway-resource-google" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "google"
      + rest_api_id = (known after apply)
    }

  # module.production.module.api-gateway.aws_api_gateway_resource.iac-api-gateway-resource-google-enter will be created
+ resource "aws_api_gateway_resource" "iac-api-gateway-resource-google-enter" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "enter"
      + rest_api_id = (known after apply)
    }

  # module.production.module.api-gateway.aws_api_gateway_rest_api.iac-api-gateway will be created
+ resource "aws_api_gateway_rest_api" "iac-api-gateway" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Proxy to handle requests to our API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "iac-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.production.module.production-vpc.aws_vpc.vpc will be destroyed
  # (because aws_vpc.vpc is not in configuration)
- resource "aws_vpc" "vpc" {
      - arn                              = "arn:aws:ec2:ap-northeast-2:264842458097:vpc/vpc-065f63385559fb8ee" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-03486df82c02f741c" -> null
      - default_route_table_id           = "rtb-01dabacb03277fcac" -> null
      - default_security_group_id        = "sg-08b165e24ed78f7c5" -> null
      - dhcp_options_id                  = "dopt-0439dc969e8731205" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-065f63385559fb8ee" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-01dabacb03277fcac" -> null
      - owner_id                         = "264842458097" -> null
      - tags                             = {
          - "Name" = "production-vpc"
        } -> null
      - tags_all                         = {
          - "Name" = "production-vpc"
        } -> null
    }

Plan: 5 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 5 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
